<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#1.-initialize-TVPB-(all-tap-tap)" data-toc-modified-id="1.-initialize-TVPB-(all-tap-tap)-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>1. initialize TVPB (all tap-tap)</a></span><ul class="toc-item"><li><span><a href="#unique-ASC-sequentially-defined-values-by-set" data-toc-modified-id="unique-ASC-sequentially-defined-values-by-set-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>unique ASC sequentially-defined values by set</a></span><ul class="toc-item"><li><span><a href="#set-1" data-toc-modified-id="set-1-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>set 1</a></span></li><li><span><a href="#set-2" data-toc-modified-id="set-2-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>set 2</a></span></li><li><span><a href="#set-3" data-toc-modified-id="set-3-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>set 3</a></span></li></ul></li></ul></li><li><span><a href="#2.-TVPB-ASC's:-Trip-Mode-Choice-(trace-hh-id-=-15)" data-toc-modified-id="2.-TVPB-ASC's:-Trip-Mode-Choice-(trace-hh-id-=-15)-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>2. TVPB ASC's: Trip Mode Choice (trace hh id = 15)</a></span><ul class="toc-item"><li><span><a href="#Unique-ASC-sequences-by-set-(preprocessor)" data-toc-modified-id="Unique-ASC-sequences-by-set-(preprocessor)-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Unique ASC sequences by set (preprocessor)</a></span></li><li><span><a href="#utility-df's-by-set" data-toc-modified-id="utility-df's-by-set-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>utility df's by set</a></span></li><li><span><a href="#Merge-unique-ASC-sequences-(preprocessor)-with-utility-df's" data-toc-modified-id="Merge-unique-ASC-sequences-(preprocessor)-with-utility-df's-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merge unique ASC sequences (preprocessor) with utility df's</a></span><ul class="toc-item"><li><span><a href="#set-1" data-toc-modified-id="set-1-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>set 1</a></span></li><li><span><a href="#set-2" data-toc-modified-id="set-2-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>set 2</a></span></li><li><span><a href="#set-3" data-toc-modified-id="set-3-2.3.3"><span class="toc-item-num">2.3.3&nbsp;&nbsp;</span>set 3</a></span></li></ul></li></ul></li></ul></div>

In [1]:
import pandas as pd

## 1. initialize TVPB (all tap-tap)

In [24]:
df = pd.read_csv(
    '../output/trace.initialize_tvpb.offset0.compute_utils.tap_tap_w_preprocessor_expr_vals.csv'
)

### unique ASC sequentially-defined values by set

#### set 1

In [26]:
df[[col for col in df.columns if 'asc' in col and 'set1' in col]].drop_duplicates()

   asc_cr_set1  asc_lrt_set1  asc_brt_set1  asc_eb_set1
0          0.0           0.0           0.0          0.0

#### set 2

In [27]:
df[[col for col in df.columns if 'asc' in col and 'set2' in col]].drop_duplicates()

       asc_cr_set2  asc_lrt_set2  asc_brt_set2  asc_eb_set2
0              0.0          0.00          0.00         0.00
8674           0.0          0.00          0.28         0.28
8806           0.0          0.56          0.56         0.56
24432         -0.0          0.00          0.00        -0.28

#### set 3

In [28]:
df[[col for col in df.columns if 'asc' in col and 'set3' in col]].drop_duplicates()

   asc_cr_set3  asc_lrt_set3  asc_brt_set3  asc_eb_set3
0          0.0          0.00          0.00         0.00
1          0.0          0.56          0.56         0.56
3          0.0          0.00          0.00        -0.28
5          0.0          0.00          0.28         0.28

## 2. TVPB ASC's: Trip Mode Choice (trace hh id = 15)

### Unique ASC sequences by set (preprocessor)

In [44]:
df = pd.read_csv(
    '../output/trace.trip_mode_choice.tvpb_logsum_odt.work.WTW.build_virtual_path.compute_tap_tap_utils.compute_utils.tap_tap_w_preprocessor_expr_vals.csv',
    index_col=0,
)

In [134]:
set1_tap_tap_uniq_asc = df.set_index(['btap','atap','tod'])[[col for col in df.columns if 'asc' in col and 'set1' in col]].drop_duplicates()
set2_tap_tap_uniq_asc = df.set_index(['btap','atap','tod'])[[col for col in df.columns if 'asc' in col and 'set2' in col]].drop_duplicates()
set3_tap_tap_uniq_asc = df.set_index(['btap','atap','tod'])[[col for col in df.columns if 'asc' in col and 'set3' in col]].drop_duplicates()

### utility df's by set

In [118]:
util_df = pd.read_csv(
    '../output/trace.trip_mode_choice.tvpb_logsum_odt.work.WTW.build_virtual_path.compute_tap_tap_utils.compute_utils.tap_tap_w_preprocessor_expr_vals.eval_utils.expression_values.csv',
    index_col=0, header=None, 
)

In [119]:
util_df.loc[util_df[1].isnull(), 1] = util_df.index.values[util_df[1].isnull()]
util_df.set_index(1, inplace=True)
util_df = util_df.T

In [122]:
util_df['btap'] = util_df['btap'].astype(int)
util_df['atap'] = util_df['atap'].astype(int)
util_df = util_df.set_index(['btap','atap','tod'])

In [123]:
set1_util_df = util_df[[col for col in util_df.columns if 'set1' in col]].astype(float)
set2_util_df = util_df[[col for col in util_df.columns if 'set2' in col]].astype(float)
set3_util_df = util_df[[col for col in util_df.columns if 'set3' in col]].astype(float)

### Merge unique ASC sequences (preprocessor) with utility df's

#### set 1

In [137]:
set1_merged = pd.merge(set1_tap_tap_uniq_asc, set1_util_df, left_index=True, right_index=True)
set1_merged[[col for col in set1_merged if 'asc' in col or 'ASC' in col]].reset_index()

,btap,atap,tod,asc_cr_set1,asc_lrt_set1,asc_brt_set1,asc_eb_set1,set1_ASC
0,2477,1238,MD,0.0,0.0,0.0,0.0,0.0

#### set 2

In [136]:
set2_merged = pd.merge(set2_tap_tap_uniq_asc, set2_util_df, left_index=True, right_index=True)
set2_merged[[col for col in set2_merged if 'asc' in col or 'ASC' in col]].reset_index()

,btap,atap,tod,asc_cr_set2,asc_lrt_set2,asc_brt_set2,asc_eb_set2,set2_ASC
0,2477,1238,MD,0.0,0.56,0.56,0.56,0.56
1,2477,1551,MD,0.0,0.00,0.00,0.00,0.00

#### set 3

In [138]:
set3_merged = pd.merge(set3_tap_tap_uniq_asc, set3_util_df, left_index=True, right_index=True)
set3_merged[[col for col in set3_merged if 'asc' in col or 'ASC' in col]].reset_index()

,btap,atap,tod,asc_cr_set3,asc_lrt_set3,asc_brt_set3,asc_eb_set3,set3_ASC
0,2477,1238,MD,0.0,0.00,0.00,0.00,0.00
1,2477,1551,MD,0.0,0.56,0.56,0.56,0.28
2,2477,2402,MD,0.0,0.00,0.00,-0.28,-0.28